{".class":"MypyFile","_fullname":"peft.tuners.multitask_prompt_tuning.config","future_import_flags":[],"is_partial_stub_package":false,"is_stub":false,"names":{".class":"SymbolTable","MultitaskPromptTuningConfig":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"TypeInfo","_promote":[],"abstract_attributes":[],"alt_promote":null,"bases":["peft.tuners.prompt_tuning.config.PromptTuningConfig"],"dataclass_transform_spec":null,"declared_metaclass":null,"defn":{".class":"ClassDef","fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig","name":"MultitaskPromptTuningConfig","type_vars":[]},"deletable_attributes":[],"deprecated":null,"flags":[],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig","has_param_spec_type":false,"metaclass_type":null,"metadata":{"dataclass":{"attributes":[{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":366,"name":"task_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":365,"name":"peft_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":90,"name":"auto_mapping","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":93,"name":"peft_version","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":361,"name":"base_model_name_or_path","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":364,"name":"revision","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":367,"name":"inference_mode","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":384,"name":"num_virtual_tokens","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":385,"name":"token_dim","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":388,"name":"num_transformer_submodules","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":391,"name":"num_attention_heads","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":392,"name":"num_layers","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":393,"name":"modules_to_save","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":38,"name":"prompt_tuning_init","type":{".class":"UnionType","items":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","builtins.str"],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":52,"name":"prompt_tuning_init_text","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":58,"name":"tokenizer_name_or_path","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":65,"name":"tokenizer_kwargs","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":47,"name":"prompt_tuning_init_state_dict_path","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":56,"name":"prompt_tuning_init_task","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":57,"name":"num_ranks","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":58,"name":"num_tasks","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}}],"frozen":false},"dataclass_tag":{}},"module_name":"peft.tuners.multitask_prompt_tuning.config","mro":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig","peft.tuners.prompt_tuning.config.PromptTuningConfig","peft.config.PromptLearningConfig","peft.config.PeftConfig","peft.config.PeftConfigMixin","transformers.utils.hub.PushToHubMixin","builtins.object"],"names":{".class":"SymbolTable","__dataclass_fields__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_classvar","is_ready"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__dataclass_fields__","name":"__dataclass_fields__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"dataclasses.Field"}],"extra_attrs":null,"type_ref":"builtins.dict"}},"plugin_generated":true},"__init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","num_virtual_tokens","token_dim","num_transformer_submodules","num_attention_heads","num_layers","modules_to_save","prompt_tuning_init","prompt_tuning_init_text","tokenizer_name_or_path","tokenizer_kwargs","prompt_tuning_init_state_dict_path","prompt_tuning_init_task","num_ranks","num_tasks"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__init__","name":"__init__","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","num_virtual_tokens","token_dim","num_transformer_submodules","num_attention_heads","num_layers","modules_to_save","prompt_tuning_init","prompt_tuning_init_text","tokenizer_name_or_path","tokenizer_kwargs","prompt_tuning_init_state_dict_path","prompt_tuning_init_task","num_ranks","num_tasks"],"arg_types":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig",{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int","builtins.int",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","builtins.str"],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__init__ of MultitaskPromptTuningConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__init__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__init__","kind":"Mdef","plugin_generated":true},"__match_args__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_ready","allow_incompatible_override"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__match_args__","name":"__match_args__","setter_type":null,"type":{".class":"TupleType","implicit":false,"items":[{".class":"LiteralType","fallback":"builtins.str","value":"task_type"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_type"},{".class":"LiteralType","fallback":"builtins.str","value":"auto_mapping"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_version"},{".class":"LiteralType","fallback":"builtins.str","value":"base_model_name_or_path"},{".class":"LiteralType","fallback":"builtins.str","value":"revision"},{".class":"LiteralType","fallback":"builtins.str","value":"inference_mode"},{".class":"LiteralType","fallback":"builtins.str","value":"num_virtual_tokens"},{".class":"LiteralType","fallback":"builtins.str","value":"token_dim"},{".class":"LiteralType","fallback":"builtins.str","value":"num_transformer_submodules"},{".class":"LiteralType","fallback":"builtins.str","value":"num_attention_heads"},{".class":"LiteralType","fallback":"builtins.str","value":"num_layers"},{".class":"LiteralType","fallback":"builtins.str","value":"modules_to_save"},{".class":"LiteralType","fallback":"builtins.str","value":"prompt_tuning_init"},{".class":"LiteralType","fallback":"builtins.str","value":"prompt_tuning_init_text"},{".class":"LiteralType","fallback":"builtins.str","value":"tokenizer_name_or_path"},{".class":"LiteralType","fallback":"builtins.str","value":"tokenizer_kwargs"},{".class":"LiteralType","fallback":"builtins.str","value":"prompt_tuning_init_state_dict_path"},{".class":"LiteralType","fallback":"builtins.str","value":"prompt_tuning_init_task"},{".class":"LiteralType","fallback":"builtins.str","value":"num_ranks"},{".class":"LiteralType","fallback":"builtins.str","value":"num_tasks"}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}},"plugin_generated":true},"__match_args__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__match_args__","kind":"Mdef","plugin_generated":true},"__mypy-post_init":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__mypy-post_init","name":"__mypy-post_init","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0],"arg_names":["self"],"arg_types":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-post_init of MultitaskPromptTuningConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__mypy-post_init-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__mypy-post_init","kind":"Mdef","plugin_generated":true},"__mypy-replace":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Decorator","func":{".class":"FuncDef","abstract_status":0,"arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","num_virtual_tokens","token_dim","num_transformer_submodules","num_attention_heads","num_layers","modules_to_save","prompt_tuning_init","prompt_tuning_init_text","tokenizer_name_or_path","tokenizer_kwargs","prompt_tuning_init_state_dict_path","prompt_tuning_init_task","num_ranks","num_tasks"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_static","is_decorated"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__mypy-replace","name":"__mypy-replace","original_first_arg":"task_type","type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","num_virtual_tokens","token_dim","num_transformer_submodules","num_attention_heads","num_layers","modules_to_save","prompt_tuning_init","prompt_tuning_init_text","tokenizer_name_or_path","tokenizer_kwargs","prompt_tuning_init_state_dict_path","prompt_tuning_init_task","num_ranks","num_tasks"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int","builtins.int",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","builtins.str"],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-replace of MultitaskPromptTuningConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"is_overload":false,"var":{".class":"Var","flags":["is_staticmethod","is_ready"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__mypy-replace","name":"__mypy-replace","setter_type":null,"type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","num_virtual_tokens","token_dim","num_transformer_submodules","num_attention_heads","num_layers","modules_to_save","prompt_tuning_init","prompt_tuning_init_text","tokenizer_name_or_path","tokenizer_kwargs","prompt_tuning_init_state_dict_path","prompt_tuning_init_task","num_ranks","num_tasks"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int","builtins.int",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","builtins.str"],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-replace of MultitaskPromptTuningConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"plugin_generated":true},"__mypy-replace-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__mypy-replace","kind":"Mdef","plugin_generated":true},"__post_init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.__post_init__","name":"__post_init__","original_first_arg":"self","type":null}},"num_ranks":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.num_ranks","name":"num_ranks","setter_type":null,"type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}}},"num_tasks":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.num_tasks","name":"num_tasks","setter_type":null,"type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}}},"prompt_tuning_init":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.prompt_tuning_init","name":"prompt_tuning_init","setter_type":null,"type":{".class":"UnionType","items":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","builtins.str"],"uses_pep604_syntax":false}}},"prompt_tuning_init_state_dict_path":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.prompt_tuning_init_state_dict_path","name":"prompt_tuning_init_state_dict_path","setter_type":null,"type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}}},"prompt_tuning_init_task":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.prompt_tuning_init_task","name":"prompt_tuning_init_task","setter_type":null,"type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}}}},"self_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig.Self","id":0,"name":"Self","namespace":"","upper_bound":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningConfig","values":[],"variance":0},"slots":null,"tuple_type":null,"type_vars":[],"typeddict_type":null}},"MultitaskPromptTuningInit":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"TypeInfo","_promote":[],"abstract_attributes":[],"alt_promote":null,"bases":["builtins.str","enum.Enum"],"dataclass_transform_spec":null,"declared_metaclass":null,"defn":{".class":"ClassDef","fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","name":"MultitaskPromptTuningInit","type_vars":[]},"deletable_attributes":[],"deprecated":null,"flags":["is_enum"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","has_param_spec_type":false,"metaclass_type":"enum.EnumMeta","metadata":{},"module_name":"peft.tuners.multitask_prompt_tuning.config","mro":["peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","builtins.str","typing.Sequence","typing.Reversible","typing.Collection","typing.Iterable","typing.Container","enum.Enum","builtins.object"],"names":{".class":"SymbolTable","AVERAGE_SOURCE_TASKS":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_final","is_ready","is_inferred","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit.AVERAGE_SOURCE_TASKS","name":"AVERAGE_SOURCE_TASKS","setter_type":null,"type":{".class":"Instance","args":[],"extra_attrs":null,"last_known_value":{".class":"LiteralType","fallback":"builtins.str","value":"AVERAGE_SOURCE_TASKS"},"type_ref":"builtins.str"}}},"EXACT_SOURCE_TASK":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_final","is_ready","is_inferred","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit.EXACT_SOURCE_TASK","name":"EXACT_SOURCE_TASK","setter_type":null,"type":{".class":"Instance","args":[],"extra_attrs":null,"last_known_value":{".class":"LiteralType","fallback":"builtins.str","value":"EXACT_SOURCE_TASK"},"type_ref":"builtins.str"}}},"ONLY_SOURCE_SHARED":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_final","is_ready","is_inferred","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit.ONLY_SOURCE_SHARED","name":"ONLY_SOURCE_SHARED","setter_type":null,"type":{".class":"Instance","args":[],"extra_attrs":null,"last_known_value":{".class":"LiteralType","fallback":"builtins.str","value":"ONLY_SOURCE_SHARED"},"type_ref":"builtins.str"}}},"RANDOM":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_final","is_ready","is_inferred","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit.RANDOM","name":"RANDOM","setter_type":null,"type":{".class":"Instance","args":[],"extra_attrs":null,"last_known_value":{".class":"LiteralType","fallback":"builtins.str","value":"RANDOM"},"type_ref":"builtins.str"}}},"TEXT":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_final","is_ready","is_inferred","has_explicit_value"],"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit.TEXT","name":"TEXT","setter_type":null,"type":{".class":"Instance","args":[],"extra_attrs":null,"last_known_value":{".class":"LiteralType","fallback":"builtins.str","value":"TEXT"},"type_ref":"builtins.str"}}}},"self_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit.Self","id":0,"name":"Self","namespace":"","upper_bound":"peft.tuners.multitask_prompt_tuning.config.MultitaskPromptTuningInit","values":[],"variance":0},"slots":null,"tuple_type":null,"type_vars":[],"typeddict_type":null}},"Optional":{".class":"SymbolTableNode","cross_ref":"typing.Optional","kind":"Gdef"},"PeftType":{".class":"SymbolTableNode","cross_ref":"peft.utils.peft_types.PeftType","kind":"Gdef"},"PromptTuningConfig":{".class":"SymbolTableNode","cross_ref":"peft.tuners.prompt_tuning.config.PromptTuningConfig","kind":"Gdef"},"Union":{".class":"SymbolTableNode","cross_ref":"typing.Union","kind":"Gdef"},"__annotations__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.multitask_prompt_tuning.config.__annotations__","name":"__annotations__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"__doc__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.multitask_prompt_tuning.config.__doc__","name":"__doc__","setter_type":null,"type":"builtins.str"}},"__file__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.multitask_prompt_tuning.config.__file__","name":"__file__","setter_type":null,"type":"builtins.str"}},"__name__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.multitask_prompt_tuning.config.__name__","name":"__name__","setter_type":null,"type":"builtins.str"}},"__package__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.multitask_prompt_tuning.config.__package__","name":"__package__","setter_type":null,"type":"builtins.str"}},"__spec__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.multitask_prompt_tuning.config.__spec__","name":"__spec__","setter_type":null,"type":"_frozen_importlib.ModuleSpec"}},"dataclass":{".class":"SymbolTableNode","cross_ref":"dataclasses.dataclass","kind":"Gdef"},"enum":{".class":"SymbolTableNode","cross_ref":"enum","kind":"Gdef"},"field":{".class":"SymbolTableNode","cross_ref":"dataclasses.field","kind":"Gdef"}},"path":"C:\\Users\\Administrator\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\peft\\tuners\\multitask_prompt_tuning\\config.py"}