{".class":"MypyFile","_fullname":"peft.tuners.adaption_prompt.config","future_import_flags":[],"is_partial_stub_package":false,"is_stub":false,"names":{".class":"SymbolTable","AdaptionPromptConfig":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"TypeInfo","_promote":[],"abstract_attributes":[],"alt_promote":null,"bases":["peft.config.PeftConfig"],"dataclass_transform_spec":null,"declared_metaclass":null,"defn":{".class":"ClassDef","fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig","name":"AdaptionPromptConfig","type_vars":[]},"deletable_attributes":[],"deprecated":null,"flags":[],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig","has_param_spec_type":false,"metaclass_type":null,"metadata":{"dataclass":{"attributes":[{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":366,"name":"task_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":365,"name":"peft_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":90,"name":"auto_mapping","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":93,"name":"peft_version","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":361,"name":"base_model_name_or_path","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":364,"name":"revision","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":367,"name":"inference_mode","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":28,"name":"target_modules","type":"builtins.str"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":31,"name":"adapter_len","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":32,"name":"adapter_layers","type":"builtins.int"}],"frozen":false},"dataclass_tag":{}},"module_name":"peft.tuners.adaption_prompt.config","mro":["peft.tuners.adaption_prompt.config.AdaptionPromptConfig","peft.config.PeftConfig","peft.config.PeftConfigMixin","transformers.utils.hub.PushToHubMixin","builtins.object"],"names":{".class":"SymbolTable","__dataclass_fields__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_classvar","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__dataclass_fields__","name":"__dataclass_fields__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"dataclasses.Field"}],"extra_attrs":null,"type_ref":"builtins.dict"}},"plugin_generated":true},"__init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","target_modules","adapter_len","adapter_layers"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__init__","name":"__init__","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","target_modules","adapter_len","adapter_layers"],"arg_types":["peft.tuners.adaption_prompt.config.AdaptionPromptConfig",{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.str","builtins.int","builtins.int"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__init__ of AdaptionPromptConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__init__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__init__","kind":"Mdef","plugin_generated":true},"__match_args__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_ready","allow_incompatible_override"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__match_args__","name":"__match_args__","setter_type":null,"type":{".class":"TupleType","implicit":false,"items":[{".class":"LiteralType","fallback":"builtins.str","value":"task_type"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_type"},{".class":"LiteralType","fallback":"builtins.str","value":"auto_mapping"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_version"},{".class":"LiteralType","fallback":"builtins.str","value":"base_model_name_or_path"},{".class":"LiteralType","fallback":"builtins.str","value":"revision"},{".class":"LiteralType","fallback":"builtins.str","value":"inference_mode"},{".class":"LiteralType","fallback":"builtins.str","value":"target_modules"},{".class":"LiteralType","fallback":"builtins.str","value":"adapter_len"},{".class":"LiteralType","fallback":"builtins.str","value":"adapter_layers"}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}},"plugin_generated":true},"__match_args__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__match_args__","kind":"Mdef","plugin_generated":true},"__mypy-post_init":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__mypy-post_init","name":"__mypy-post_init","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0],"arg_names":["self"],"arg_types":["peft.tuners.adaption_prompt.config.AdaptionPromptConfig"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-post_init of AdaptionPromptConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__mypy-post_init-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__mypy-post_init","kind":"Mdef","plugin_generated":true},"__mypy-replace":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Decorator","func":{".class":"FuncDef","abstract_status":0,"arg_kinds":[5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","target_modules","adapter_len","adapter_layers"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_static","is_decorated"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__mypy-replace","name":"__mypy-replace","original_first_arg":"task_type","type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","target_modules","adapter_len","adapter_layers"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.str","builtins.int","builtins.int"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-replace of AdaptionPromptConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"is_overload":false,"var":{".class":"Var","flags":["is_staticmethod","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__mypy-replace","name":"__mypy-replace","setter_type":null,"type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","target_modules","adapter_len","adapter_layers"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.str","builtins.int","builtins.int"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-replace of AdaptionPromptConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"plugin_generated":true},"__mypy-replace-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__mypy-replace","kind":"Mdef","plugin_generated":true},"__post_init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.__post_init__","name":"__post_init__","original_first_arg":"self","type":null}},"adapter_layers":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.adapter_layers","name":"adapter_layers","setter_type":null,"type":"builtins.int"}},"adapter_len":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.adapter_len","name":"adapter_len","setter_type":null,"type":"builtins.int"}},"is_adaption_prompt":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Decorator","func":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_property","is_decorated","is_trivial_self"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.is_adaption_prompt","name":"is_adaption_prompt","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0],"arg_names":["self"],"arg_types":["peft.tuners.adaption_prompt.config.AdaptionPromptConfig"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"is_adaption_prompt of AdaptionPromptConfig","ret_type":"builtins.bool","type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"is_overload":false,"var":{".class":"Var","flags":["is_initialized_in_class","is_property","is_ready","is_inferred"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.is_adaption_prompt","name":"is_adaption_prompt","setter_type":null,"type":{".class":"CallableType","arg_kinds":[0],"arg_names":["self"],"arg_types":["peft.tuners.adaption_prompt.config.AdaptionPromptConfig"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"is_adaption_prompt of AdaptionPromptConfig","ret_type":"builtins.bool","type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}}},"target_modules":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.target_modules","name":"target_modules","setter_type":null,"type":"builtins.str"}}},"self_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig.Self","id":0,"name":"Self","namespace":"","upper_bound":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig","values":[],"variance":0},"slots":null,"tuple_type":null,"type_vars":[],"typeddict_type":null}},"ModelTypeConfig":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"TypeInfo","_promote":[],"abstract_attributes":[],"alt_promote":null,"bases":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}],"dataclass_transform_spec":null,"declared_metaclass":null,"defn":{".class":"ClassDef","fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig","name":"ModelTypeConfig","type_vars":[]},"deletable_attributes":[],"deprecated":null,"flags":["is_named_tuple"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig","has_param_spec_type":false,"metaclass_type":null,"metadata":{"namedtuple":{"fields":["compute_query_states","target_modules","k_proj_layer","v_proj_layer","o_proj_layer"]}},"module_name":"peft.tuners.adaption_prompt.config","mro":["peft.tuners.adaption_prompt.config.ModelTypeConfig","builtins.tuple","typing.Sequence","typing.Reversible","typing.Collection","typing.Iterable","typing.Container","builtins.object"],"names":{".class":"SymbolTable","_NT":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"TypeVarExpr","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","name":"_NT","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}},"__annotations__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.__annotations__","name":"__annotations__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"__doc__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.__doc__","name":"__doc__","setter_type":null,"type":"builtins.str"}},"__match_args__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.__match_args__","name":"__match_args__","setter_type":null,"type":{".class":"TupleType","implicit":false,"items":[{".class":"LiteralType","fallback":"builtins.str","value":"compute_query_states"},{".class":"LiteralType","fallback":"builtins.str","value":"target_modules"},{".class":"LiteralType","fallback":"builtins.str","value":"k_proj_layer"},{".class":"LiteralType","fallback":"builtins.str","value":"v_proj_layer"},{".class":"LiteralType","fallback":"builtins.str","value":"o_proj_layer"}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}}},"__new__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0,0,0,0,0],"arg_names":["_cls","compute_query_states","target_modules","k_proj_layer","v_proj_layer","o_proj_layer"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_static"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.__new__","name":"__new__","original_first_arg":"_cls","type":{".class":"CallableType","arg_kinds":[0,0,0,0,0,0],"arg_names":["_cls","compute_query_states","target_modules","k_proj_layer","v_proj_layer","o_proj_layer"],"arg_types":[{".class":"TypeType","is_type_form":false,"item":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig.__new__","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__new__ of ModelTypeConfig","ret_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig.__new__","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig.__new__","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}]}},"plugin_generated":true},"_asdict":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["_self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._asdict","name":"_asdict","original_first_arg":"_self","type":{".class":"CallableType","arg_kinds":[0],"arg_names":["_self"],"arg_types":[{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._asdict","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_asdict of ModelTypeConfig","ret_type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._asdict","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}]}},"plugin_generated":true},"_field_defaults":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._field_defaults","name":"_field_defaults","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"_field_types":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._field_types","name":"_field_types","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"_fields":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._fields","name":"_fields","setter_type":null,"type":{".class":"TupleType","implicit":false,"items":["builtins.str","builtins.str","builtins.str","builtins.str","builtins.str"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}}},"_make":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Decorator","func":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0],"arg_names":["_cls","iterable"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_class","is_decorated"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._make","name":"_make","original_first_arg":"_cls","type":{".class":"CallableType","arg_kinds":[0,0],"arg_names":["_cls","iterable"],"arg_types":[{".class":"TypeType","is_type_form":false,"item":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._make","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}},{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"typing.Iterable"}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_make of ModelTypeConfig","ret_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._make","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._make","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}]}},"is_overload":false,"var":{".class":"Var","flags":["is_classmethod","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._make","name":"_make","setter_type":null,"type":{".class":"CallableType","arg_kinds":[0,0],"arg_names":["_cls","iterable"],"arg_types":[{".class":"TypeType","is_type_form":false,"item":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._make","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}},{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"typing.Iterable"}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_make of ModelTypeConfig","ret_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._make","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._make","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}]}}},"plugin_generated":true},"_replace":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,5,5,5,5,5],"arg_names":["_self","compute_query_states","target_modules","k_proj_layer","v_proj_layer","o_proj_layer"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._replace","name":"_replace","original_first_arg":"_self","type":{".class":"CallableType","arg_kinds":[0,5,5,5,5,5],"arg_names":["_self","compute_query_states","target_modules","k_proj_layer","v_proj_layer","o_proj_layer"],"arg_types":[{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._replace","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_replace of ModelTypeConfig","ret_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._replace","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._NT","id":-1,"name":"_NT","namespace":"peft.tuners.adaption_prompt.config.ModelTypeConfig._replace","upper_bound":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"values":[],"variance":0}]}},"plugin_generated":true},"_source":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig._source","name":"_source","setter_type":null,"type":"builtins.str"}},"compute_query_states":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_property","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.compute_query_states","name":"compute_query_states","setter_type":null,"type":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}}},"k_proj_layer":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_property","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.k_proj_layer","name":"k_proj_layer","setter_type":null,"type":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}}},"o_proj_layer":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_property","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.o_proj_layer","name":"o_proj_layer","setter_type":null,"type":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}}},"target_modules":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_property","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.target_modules","name":"target_modules","setter_type":null,"type":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}}},"v_proj_layer":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_property","is_ready"],"fullname":"peft.tuners.adaption_prompt.config.ModelTypeConfig.v_proj_layer","name":"v_proj_layer","setter_type":null,"type":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}}}},"self_type":null,"slots":null,"tuple_type":{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"type_vars":[],"typeddict_type":null}},"PeftConfig":{".class":"SymbolTableNode","cross_ref":"peft.config.PeftConfig","kind":"Gdef"},"PeftType":{".class":"SymbolTableNode","cross_ref":"peft.utils.peft_types.PeftType","kind":"Gdef"},"TRANSFORMERS_MODEL_CONFIG":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready","is_inferred","has_explicit_value"],"fullname":"peft.tuners.adaption_prompt.config.TRANSFORMERS_MODEL_CONFIG","name":"TRANSFORMERS_MODEL_CONFIG","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"TupleType","implicit":false,"items":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"partial_fallback":"peft.tuners.adaption_prompt.config.ModelTypeConfig"}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"__annotations__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adaption_prompt.config.__annotations__","name":"__annotations__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"__doc__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adaption_prompt.config.__doc__","name":"__doc__","setter_type":null,"type":"builtins.str"}},"__file__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adaption_prompt.config.__file__","name":"__file__","setter_type":null,"type":"builtins.str"}},"__name__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adaption_prompt.config.__name__","name":"__name__","setter_type":null,"type":"builtins.str"}},"__package__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adaption_prompt.config.__package__","name":"__package__","setter_type":null,"type":"builtins.str"}},"__spec__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.adaption_prompt.config.__spec__","name":"__spec__","setter_type":null,"type":"_frozen_importlib.ModuleSpec"}},"dataclass":{".class":"SymbolTableNode","cross_ref":"dataclasses.dataclass","kind":"Gdef"},"field":{".class":"SymbolTableNode","cross_ref":"dataclasses.field","kind":"Gdef"},"gpt2_compute_query_states":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adaption_prompt.utils.gpt2_compute_query_states","kind":"Gdef"},"llama_compute_query_states":{".class":"SymbolTableNode","cross_ref":"peft.tuners.adaption_prompt.utils.llama_compute_query_states","kind":"Gdef"},"namedtuple":{".class":"SymbolTableNode","cross_ref":"collections.namedtuple","kind":"Gdef"},"prepare_config":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0],"arg_names":["peft_config","model"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.adaption_prompt.config.prepare_config","name":"prepare_config","original_first_arg":"peft_config","type":{".class":"CallableType","arg_kinds":[0,0],"arg_names":["peft_config","model"],"arg_types":["peft.tuners.adaption_prompt.config.AdaptionPromptConfig",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"prepare_config","ret_type":"peft.tuners.adaption_prompt.config.AdaptionPromptConfig","type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}}},"path":"C:\\Users\\Administrator\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\peft\\tuners\\adaption_prompt\\config.py"}