{".class":"MypyFile","_fullname":"torch.distributed.checkpoint.quantized_hf_storage","future_import_flags":[],"is_partial_stub_package":false,"is_stub":false,"names":{".class":"SymbolTable","Any":{".class":"SymbolTableNode","cross_ref":"typing.Any","kind":"Gdef","module_public":false},"HuggingFaceStorageReader":{".class":"SymbolTableNode","cross_ref":"torch.distributed.checkpoint.hf_storage.HuggingFaceStorageReader","kind":"Gdef","module_public":false},"LoadPlanner":{".class":"SymbolTableNode","cross_ref":"torch.distributed.checkpoint.planner.LoadPlanner","kind":"Gdef","module_public":false},"Path":{".class":"SymbolTableNode","cross_ref":"pathlib.Path","kind":"Gdef","module_public":false},"QuantizedHuggingFaceStorageReader":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"TypeInfo","_promote":[],"abstract_attributes":[],"alt_promote":null,"bases":["torch.distributed.checkpoint.hf_storage.HuggingFaceStorageReader"],"dataclass_transform_spec":null,"declared_metaclass":null,"defn":{".class":"ClassDef","fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","name":"QuantizedHuggingFaceStorageReader","type_vars":[]},"deletable_attributes":[],"deprecated":null,"flags":[],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","has_param_spec_type":false,"metaclass_type":"abc.ABCMeta","metadata":{},"module_name":"torch.distributed.checkpoint.quantized_hf_storage","mro":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","torch.distributed.checkpoint.hf_storage.HuggingFaceStorageReader","torch.distributed.checkpoint.filesystem.FileSystemReader","torch.distributed.checkpoint.storage.StorageReader","abc.ABC","builtins.object"],"names":{".class":"SymbolTable","__init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0,1,1,1],"arg_names":["self","path","thread_count","target_dtype","block_size"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader.__init__","name":"__init__","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,0,1,1,1],"arg_names":["self","path","thread_count","target_dtype","block_size"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","builtins.str","builtins.int","torch._C.dtype","builtins.int"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__init__ of QuantizedHuggingFaceStorageReader","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"_build_weight_scale_mapping":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0],"arg_names":["self","weight_map"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._build_weight_scale_mapping","name":"_build_weight_scale_mapping","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,0],"arg_names":["self","weight_map"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader",{".class":"Instance","args":["builtins.str","builtins.str"],"extra_attrs":null,"type_ref":"builtins.dict"}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_build_weight_scale_mapping of QuantizedHuggingFaceStorageReader","ret_type":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":1},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"_dequantize_tensor":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0,0,0,0],"arg_names":["self","weight","scale_inv","full_tensor_shape","slice_info"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._dequantize_tensor","name":"_dequantize_tensor","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,0,0,0,0],"arg_names":["self","weight","scale_inv","full_tensor_shape","slice_info"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","torch._tensor.Tensor","torch._tensor.Tensor","torch._C.Size",{".class":"TupleType","implicit":false,"items":[{".class":"TupleType","implicit":false,"items":["builtins.int","builtins.int"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}},{".class":"TupleType","implicit":false,"items":["builtins.int","builtins.int"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}},{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"builtins.slice"},{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"builtins.slice"}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_dequantize_tensor of QuantizedHuggingFaceStorageReader","ret_type":"torch._tensor.Tensor","type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"_dequantize_tensor_mxfp4":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0,0,0,0,0],"arg_names":["self","blocks","scales","req","group_start","offset_in_first_group"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._dequantize_tensor_mxfp4","name":"_dequantize_tensor_mxfp4","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,0,0,0,0,0],"arg_names":["self","blocks","scales","req","group_start","offset_in_first_group"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","torch._tensor.Tensor","torch._tensor.Tensor","torch.distributed.checkpoint.planner.ReadItem","builtins.int","builtins.int"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_dequantize_tensor_mxfp4 of QuantizedHuggingFaceStorageReader","ret_type":"torch._tensor.Tensor","type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"_get_slice_to_block_mapping":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0],"arg_names":["self","req"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._get_slice_to_block_mapping","name":"_get_slice_to_block_mapping","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,0],"arg_names":["self","req"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","torch.distributed.checkpoint.planner.ReadItem"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_get_slice_to_block_mapping of QuantizedHuggingFaceStorageReader","ret_type":{".class":"TupleType","implicit":false,"items":[{".class":"TupleType","implicit":false,"items":["builtins.int","builtins.int"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}},{".class":"TupleType","implicit":false,"items":["builtins.int","builtins.int"],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}},{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"builtins.slice"},{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"builtins.slice"}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"_is_tensor_quantized":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0],"arg_names":["self","tensor_fqn"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._is_tensor_quantized","name":"_is_tensor_quantized","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,0],"arg_names":["self","tensor_fqn"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","builtins.str"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_is_tensor_quantized of QuantizedHuggingFaceStorageReader","ret_type":"builtins.bool","type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"_load_quantization_metadata":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._load_quantization_metadata","name":"_load_quantization_metadata","original_first_arg":"self","type":null}},"_process_read_request":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0,0,0],"arg_names":["self","f","req","planner"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._process_read_request","name":"_process_read_request","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,0,0,0],"arg_names":["self","f","req","planner"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},"torch.distributed.checkpoint.planner.ReadItem","torch.distributed.checkpoint.planner.LoadPlanner"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_process_read_request of QuantizedHuggingFaceStorageReader","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"_read_quantized_tensor_with_block_alignment":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,0,0],"arg_names":["self","req","safetensor_file"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._read_quantized_tensor_with_block_alignment","name":"_read_quantized_tensor_with_block_alignment","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,0,0],"arg_names":["self","req","safetensor_file"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","torch.distributed.checkpoint.planner.ReadItem",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"_read_quantized_tensor_with_block_alignment of QuantizedHuggingFaceStorageReader","ret_type":"torch._tensor.Tensor","type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"_tensor_full_shapes":{".class":"SymbolTableNode","implicit":true,"kind":"Mdef","node":{".class":"Var","flags":["explicit_self_type","is_ready","is_inferred"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._tensor_full_shapes","name":"_tensor_full_shapes","setter_type":null,"type":{".class":"Instance","args":["builtins.str","torch._C.Size"],"extra_attrs":null,"type_ref":"builtins.dict"}}},"_weight_map":{".class":"SymbolTableNode","implicit":true,"kind":"Mdef","node":{".class":"Var","flags":["explicit_self_type","is_ready","is_inferred"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._weight_map","name":"_weight_map","setter_type":null,"type":{".class":"Instance","args":["builtins.str","builtins.str"],"extra_attrs":null,"type_ref":"builtins.dict"}}},"_weight_scale_mapping":{".class":"SymbolTableNode","implicit":true,"kind":"Mdef","node":{".class":"Var","flags":["explicit_self_type","is_ready","is_inferred"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader._weight_scale_mapping","name":"_weight_scale_mapping","setter_type":null,"type":{".class":"Instance","args":["builtins.str","builtins.str"],"extra_attrs":null,"type_ref":"builtins.dict"}}},"block_size":{".class":"SymbolTableNode","implicit":true,"kind":"Mdef","node":{".class":"Var","flags":["explicit_self_type","is_ready","is_inferred"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader.block_size","name":"block_size","setter_type":null,"type":"builtins.int"}},"read_metadata":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_trivial_self"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader.read_metadata","name":"read_metadata","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0],"arg_names":["self"],"arg_types":["torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"read_metadata of QuantizedHuggingFaceStorageReader","ret_type":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"target_dtype":{".class":"SymbolTableNode","implicit":true,"kind":"Mdef","node":{".class":"Var","flags":["explicit_self_type","is_ready","is_inferred"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader.target_dtype","name":"target_dtype","setter_type":null,"type":"torch._C.dtype"}}},"self_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader.Self","id":0,"name":"Self","namespace":"","upper_bound":"torch.distributed.checkpoint.quantized_hf_storage.QuantizedHuggingFaceStorageReader","values":[],"variance":0},"slots":null,"tuple_type":null,"type_vars":[],"typeddict_type":null}},"ReadItem":{".class":"SymbolTableNode","cross_ref":"torch.distributed.checkpoint.planner.ReadItem","kind":"Gdef","module_public":false},"TensorStorageMetadata":{".class":"SymbolTableNode","cross_ref":"torch.distributed.checkpoint.metadata.TensorStorageMetadata","kind":"Gdef","module_public":false},"__all__":{".class":"SymbolTableNode","kind":"Gdef","module_public":false,"node":{".class":"Var","flags":["is_ready","is_inferred","has_explicit_value"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.__all__","name":"__all__","setter_type":null,"type":{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"}}},"__annotations__":{".class":"SymbolTableNode","kind":"Gdef","module_public":false,"node":{".class":"Var","flags":["is_ready"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.__annotations__","name":"__annotations__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"__doc__":{".class":"SymbolTableNode","kind":"Gdef","module_public":false,"node":{".class":"Var","flags":["is_ready"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.__doc__","name":"__doc__","setter_type":null,"type":"builtins.str"}},"__file__":{".class":"SymbolTableNode","kind":"Gdef","module_public":false,"node":{".class":"Var","flags":["is_ready"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.__file__","name":"__file__","setter_type":null,"type":"builtins.str"}},"__name__":{".class":"SymbolTableNode","kind":"Gdef","module_public":false,"node":{".class":"Var","flags":["is_ready"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.__name__","name":"__name__","setter_type":null,"type":"builtins.str"}},"__package__":{".class":"SymbolTableNode","kind":"Gdef","module_public":false,"node":{".class":"Var","flags":["is_ready"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.__package__","name":"__package__","setter_type":null,"type":"builtins.str"}},"__spec__":{".class":"SymbolTableNode","kind":"Gdef","module_public":false,"node":{".class":"Var","flags":["is_ready"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.__spec__","name":"__spec__","setter_type":null,"type":"_frozen_importlib.ModuleSpec"}},"_metadata_fn":{".class":"SymbolTableNode","cross_ref":"torch.distributed.checkpoint._hf_utils._metadata_fn","kind":"Gdef","module_public":false},"json":{".class":"SymbolTableNode","cross_ref":"json","kind":"Gdef","module_public":false},"logger":{".class":"SymbolTableNode","kind":"Gdef","module_public":false,"node":{".class":"Var","flags":["is_ready","has_explicit_value"],"fullname":"torch.distributed.checkpoint.quantized_hf_storage.logger","name":"logger","setter_type":null,"type":"logging.Logger"}},"logging":{".class":"SymbolTableNode","cross_ref":"logging","kind":"Gdef","module_public":false},"math":{".class":"SymbolTableNode","cross_ref":"math","kind":"Gdef","module_public":false},"torch":{".class":"SymbolTableNode","cross_ref":"torch","kind":"Gdef","module_public":false}},"path":"C:\\Users\\Administrator\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\torch\\distributed\\checkpoint\\quantized_hf_storage.py"}