{".class":"MypyFile","_fullname":"peft.tuners.xlora.config","future_import_flags":["annotations"],"is_partial_stub_package":false,"is_stub":false,"names":{".class":"SymbolTable","Optional":{".class":"SymbolTableNode","cross_ref":"typing.Optional","kind":"Gdef"},"PeftConfig":{".class":"SymbolTableNode","cross_ref":"peft.config.PeftConfig","kind":"Gdef"},"PeftType":{".class":"SymbolTableNode","cross_ref":"peft.utils.peft_types.PeftType","kind":"Gdef"},"XLoraConfig":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"TypeInfo","_promote":[],"abstract_attributes":[],"alt_promote":null,"bases":["peft.config.PeftConfig"],"dataclass_transform_spec":null,"declared_metaclass":null,"defn":{".class":"ClassDef","fullname":"peft.tuners.xlora.config.XLoraConfig","name":"XLoraConfig","type_vars":[]},"deletable_attributes":[],"deprecated":null,"flags":[],"fullname":"peft.tuners.xlora.config.XLoraConfig","has_param_spec_type":false,"metaclass_type":null,"metadata":{"dataclass":{"attributes":[{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":366,"name":"task_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":365,"name":"peft_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":90,"name":"auto_mapping","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":93,"name":"peft_version","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":361,"name":"base_model_name_or_path","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":364,"name":"revision","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":367,"name":"inference_mode","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":64,"name":"hidden_size","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":65,"name":"adapters","type":{".class":"Instance","args":["builtins.str","builtins.str"],"extra_attrs":null,"type_ref":"builtins.dict"}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":66,"name":"enable_softmax","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":67,"name":"enable_softmax_topk","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":68,"name":"layerwise_scalings","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":69,"name":"xlora_depth","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":70,"name":"xlora_size","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":71,"name":"xlora_dropout_p","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":72,"name":"use_trainable_adapters","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":73,"name":"softmax_temperature","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":74,"name":"top_k_lora","type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":75,"name":"scaling_pass_value","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":76,"name":"global_scaling_weight","type":"builtins.float"}],"frozen":false},"dataclass_tag":{}},"module_name":"peft.tuners.xlora.config","mro":["peft.tuners.xlora.config.XLoraConfig","peft.config.PeftConfig","peft.config.PeftConfigMixin","transformers.utils.hub.PushToHubMixin","builtins.object"],"names":{".class":"SymbolTable","__dataclass_fields__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_classvar","is_ready"],"fullname":"peft.tuners.xlora.config.XLoraConfig.__dataclass_fields__","name":"__dataclass_fields__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"dataclasses.Field"}],"extra_attrs":null,"type_ref":"builtins.dict"}},"plugin_generated":true},"__init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","hidden_size","adapters","enable_softmax","enable_softmax_topk","layerwise_scalings","xlora_depth","xlora_size","xlora_dropout_p","use_trainable_adapters","softmax_temperature","top_k_lora","scaling_pass_value","global_scaling_weight"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.xlora.config.XLoraConfig.__init__","name":"__init__","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","hidden_size","adapters","enable_softmax","enable_softmax_topk","layerwise_scalings","xlora_depth","xlora_size","xlora_dropout_p","use_trainable_adapters","softmax_temperature","top_k_lora","scaling_pass_value","global_scaling_weight"],"arg_types":["peft.tuners.xlora.config.XLoraConfig",{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int",{".class":"Instance","args":["builtins.str","builtins.str"],"extra_attrs":null,"type_ref":"builtins.dict"},"builtins.bool","builtins.bool","builtins.bool","builtins.int","builtins.int","builtins.float","builtins.bool","builtins.float",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.float","builtins.float"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__init__ of XLoraConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__init__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.xlora.config.XLoraConfig.__init__","kind":"Mdef","plugin_generated":true},"__match_args__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_ready","allow_incompatible_override"],"fullname":"peft.tuners.xlora.config.XLoraConfig.__match_args__","name":"__match_args__","setter_type":null,"type":{".class":"TupleType","implicit":false,"items":[{".class":"LiteralType","fallback":"builtins.str","value":"task_type"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_type"},{".class":"LiteralType","fallback":"builtins.str","value":"auto_mapping"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_version"},{".class":"LiteralType","fallback":"builtins.str","value":"base_model_name_or_path"},{".class":"LiteralType","fallback":"builtins.str","value":"revision"},{".class":"LiteralType","fallback":"builtins.str","value":"inference_mode"},{".class":"LiteralType","fallback":"builtins.str","value":"hidden_size"},{".class":"LiteralType","fallback":"builtins.str","value":"adapters"},{".class":"LiteralType","fallback":"builtins.str","value":"enable_softmax"},{".class":"LiteralType","fallback":"builtins.str","value":"enable_softmax_topk"},{".class":"LiteralType","fallback":"builtins.str","value":"layerwise_scalings"},{".class":"LiteralType","fallback":"builtins.str","value":"xlora_depth"},{".class":"LiteralType","fallback":"builtins.str","value":"xlora_size"},{".class":"LiteralType","fallback":"builtins.str","value":"xlora_dropout_p"},{".class":"LiteralType","fallback":"builtins.str","value":"use_trainable_adapters"},{".class":"LiteralType","fallback":"builtins.str","value":"softmax_temperature"},{".class":"LiteralType","fallback":"builtins.str","value":"top_k_lora"},{".class":"LiteralType","fallback":"builtins.str","value":"scaling_pass_value"},{".class":"LiteralType","fallback":"builtins.str","value":"global_scaling_weight"}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}},"plugin_generated":true},"__match_args__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.xlora.config.XLoraConfig.__match_args__","kind":"Mdef","plugin_generated":true},"__mypy-post_init":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.xlora.config.XLoraConfig.__mypy-post_init","name":"__mypy-post_init","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0],"arg_names":["self"],"arg_types":["peft.tuners.xlora.config.XLoraConfig"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-post_init of XLoraConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__mypy-post_init-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.xlora.config.XLoraConfig.__mypy-post_init","kind":"Mdef","plugin_generated":true},"__mypy-replace":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Decorator","func":{".class":"FuncDef","abstract_status":0,"arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","hidden_size","adapters","enable_softmax","enable_softmax_topk","layerwise_scalings","xlora_depth","xlora_size","xlora_dropout_p","use_trainable_adapters","softmax_temperature","top_k_lora","scaling_pass_value","global_scaling_weight"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_static","is_decorated"],"fullname":"peft.tuners.xlora.config.XLoraConfig.__mypy-replace","name":"__mypy-replace","original_first_arg":"task_type","type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","hidden_size","adapters","enable_softmax","enable_softmax_topk","layerwise_scalings","xlora_depth","xlora_size","xlora_dropout_p","use_trainable_adapters","softmax_temperature","top_k_lora","scaling_pass_value","global_scaling_weight"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int",{".class":"Instance","args":["builtins.str","builtins.str"],"extra_attrs":null,"type_ref":"builtins.dict"},"builtins.bool","builtins.bool","builtins.bool","builtins.int","builtins.int","builtins.float","builtins.bool","builtins.float",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.float","builtins.float"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-replace of XLoraConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"is_overload":false,"var":{".class":"Var","flags":["is_staticmethod","is_ready"],"fullname":"peft.tuners.xlora.config.XLoraConfig.__mypy-replace","name":"__mypy-replace","setter_type":null,"type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","hidden_size","adapters","enable_softmax","enable_softmax_topk","layerwise_scalings","xlora_depth","xlora_size","xlora_dropout_p","use_trainable_adapters","softmax_temperature","top_k_lora","scaling_pass_value","global_scaling_weight"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int",{".class":"Instance","args":["builtins.str","builtins.str"],"extra_attrs":null,"type_ref":"builtins.dict"},"builtins.bool","builtins.bool","builtins.bool","builtins.int","builtins.int","builtins.float","builtins.bool","builtins.float",{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.float","builtins.float"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-replace of XLoraConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"plugin_generated":true},"__mypy-replace-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.xlora.config.XLoraConfig.__mypy-replace","kind":"Mdef","plugin_generated":true},"__post_init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.xlora.config.XLoraConfig.__post_init__","name":"__post_init__","original_first_arg":"self","type":null}},"adapters":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.adapters","name":"adapters","setter_type":null,"type":{".class":"Instance","args":["builtins.str","builtins.str"],"extra_attrs":null,"type_ref":"builtins.dict"}}},"enable_softmax":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.enable_softmax","name":"enable_softmax","setter_type":null,"type":"builtins.bool"}},"enable_softmax_topk":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.enable_softmax_topk","name":"enable_softmax_topk","setter_type":null,"type":"builtins.bool"}},"global_scaling_weight":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.global_scaling_weight","name":"global_scaling_weight","setter_type":null,"type":"builtins.float"}},"hidden_size":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.hidden_size","name":"hidden_size","setter_type":null,"type":"builtins.int"}},"layerwise_scalings":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.layerwise_scalings","name":"layerwise_scalings","setter_type":null,"type":"builtins.bool"}},"scaling_pass_value":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.scaling_pass_value","name":"scaling_pass_value","setter_type":null,"type":"builtins.float"}},"softmax_temperature":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.softmax_temperature","name":"softmax_temperature","setter_type":null,"type":"builtins.float"}},"top_k_lora":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.top_k_lora","name":"top_k_lora","setter_type":null,"type":{".class":"UnionType","items":["builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}}},"use_trainable_adapters":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.use_trainable_adapters","name":"use_trainable_adapters","setter_type":null,"type":"builtins.bool"}},"xlora_depth":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.xlora_depth","name":"xlora_depth","setter_type":null,"type":"builtins.int"}},"xlora_dropout_p":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.xlora_dropout_p","name":"xlora_dropout_p","setter_type":null,"type":"builtins.float"}},"xlora_size":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.xlora.config.XLoraConfig.xlora_size","name":"xlora_size","setter_type":null,"type":"builtins.int"}}},"self_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.xlora.config.XLoraConfig.Self","id":0,"name":"Self","namespace":"","upper_bound":"peft.tuners.xlora.config.XLoraConfig","values":[],"variance":0},"slots":null,"tuple_type":null,"type_vars":[],"typeddict_type":null}},"__annotations__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.xlora.config.__annotations__","name":"__annotations__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"__doc__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.xlora.config.__doc__","name":"__doc__","setter_type":null,"type":"builtins.str"}},"__file__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.xlora.config.__file__","name":"__file__","setter_type":null,"type":"builtins.str"}},"__name__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.xlora.config.__name__","name":"__name__","setter_type":null,"type":"builtins.str"}},"__package__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.xlora.config.__package__","name":"__package__","setter_type":null,"type":"builtins.str"}},"__spec__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.xlora.config.__spec__","name":"__spec__","setter_type":null,"type":"_frozen_importlib.ModuleSpec"}},"annotations":{".class":"SymbolTableNode","cross_ref":"__future__.annotations","kind":"Gdef"},"dataclass":{".class":"SymbolTableNode","cross_ref":"dataclasses.dataclass","kind":"Gdef"},"warnings":{".class":"SymbolTableNode","cross_ref":"warnings","kind":"Gdef"}},"path":"C:\\Users\\Administrator\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\peft\\tuners\\xlora\\config.py"}