{".class":"MypyFile","_fullname":"peft.tuners.vblora.config","future_import_flags":["annotations"],"is_partial_stub_package":false,"is_stub":false,"names":{".class":"SymbolTable","Optional":{".class":"SymbolTableNode","cross_ref":"typing.Optional","kind":"Gdef"},"PeftConfig":{".class":"SymbolTableNode","cross_ref":"peft.config.PeftConfig","kind":"Gdef"},"PeftType":{".class":"SymbolTableNode","cross_ref":"peft.utils.peft_types.PeftType","kind":"Gdef"},"Union":{".class":"SymbolTableNode","cross_ref":"typing.Union","kind":"Gdef"},"VBLoRAConfig":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"TypeInfo","_promote":[],"abstract_attributes":[],"alt_promote":null,"bases":["peft.config.PeftConfig"],"dataclass_transform_spec":null,"declared_metaclass":null,"defn":{".class":"ClassDef","fullname":"peft.tuners.vblora.config.VBLoRAConfig","name":"VBLoRAConfig","type_vars":[]},"deletable_attributes":[],"deprecated":null,"flags":[],"fullname":"peft.tuners.vblora.config.VBLoRAConfig","has_param_spec_type":false,"metaclass_type":null,"metadata":{"dataclass":{"attributes":[{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":366,"name":"task_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":365,"name":"peft_type","type":{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":90,"name":"auto_mapping","type":{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":93,"name":"peft_version","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":361,"name":"base_model_name_or_path","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":364,"name":"revision","type":{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":367,"name":"inference_mode","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":87,"name":"r","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":88,"name":"num_vectors","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":92,"name":"vector_length","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":99,"name":"topk","type":"builtins.int"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":107,"name":"target_modules","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":119,"name":"exclude_modules","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":123,"name":"save_only_topk_weights","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":133,"name":"vblora_dropout","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":134,"name":"fan_in_fan_out","type":"builtins.bool"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":138,"name":"bias","type":"builtins.str"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":139,"name":"modules_to_save","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":149,"name":"init_vector_bank_bound","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":160,"name":"init_logits_std","type":"builtins.float"},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":169,"name":"layers_to_transform","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}},{"alias":null,"column":4,"has_default":true,"is_in_init":true,"is_init_var":false,"is_neither_frozen_nor_nonfrozen":false,"kw_only":false,"line":177,"name":"layers_pattern","type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}}],"frozen":false},"dataclass_tag":{}},"module_name":"peft.tuners.vblora.config","mro":["peft.tuners.vblora.config.VBLoRAConfig","peft.config.PeftConfig","peft.config.PeftConfigMixin","transformers.utils.hub.PushToHubMixin","builtins.object"],"names":{".class":"SymbolTable","__dataclass_fields__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_classvar","is_ready"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.__dataclass_fields__","name":"__dataclass_fields__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":2}],"extra_attrs":null,"type_ref":"dataclasses.Field"}],"extra_attrs":null,"type_ref":"builtins.dict"}},"plugin_generated":true},"__init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","r","num_vectors","vector_length","topk","target_modules","exclude_modules","save_only_topk_weights","vblora_dropout","fan_in_fan_out","bias","modules_to_save","init_vector_bank_bound","init_logits_std","layers_to_transform","layers_pattern"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.__init__","name":"__init__","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1],"arg_names":["self","task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","r","num_vectors","vector_length","topk","target_modules","exclude_modules","save_only_topk_weights","vblora_dropout","fan_in_fan_out","bias","modules_to_save","init_vector_bank_bound","init_logits_std","layers_to_transform","layers_pattern"],"arg_types":["peft.tuners.vblora.config.VBLoRAConfig",{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int","builtins.int","builtins.int","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.float","builtins.bool","builtins.str",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.float","builtins.float",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__init__ of VBLoRAConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__init__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.vblora.config.VBLoRAConfig.__init__","kind":"Mdef","plugin_generated":true},"__match_args__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_ready","allow_incompatible_override"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.__match_args__","name":"__match_args__","setter_type":null,"type":{".class":"TupleType","implicit":false,"items":[{".class":"LiteralType","fallback":"builtins.str","value":"task_type"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_type"},{".class":"LiteralType","fallback":"builtins.str","value":"auto_mapping"},{".class":"LiteralType","fallback":"builtins.str","value":"peft_version"},{".class":"LiteralType","fallback":"builtins.str","value":"base_model_name_or_path"},{".class":"LiteralType","fallback":"builtins.str","value":"revision"},{".class":"LiteralType","fallback":"builtins.str","value":"inference_mode"},{".class":"LiteralType","fallback":"builtins.str","value":"r"},{".class":"LiteralType","fallback":"builtins.str","value":"num_vectors"},{".class":"LiteralType","fallback":"builtins.str","value":"vector_length"},{".class":"LiteralType","fallback":"builtins.str","value":"topk"},{".class":"LiteralType","fallback":"builtins.str","value":"target_modules"},{".class":"LiteralType","fallback":"builtins.str","value":"exclude_modules"},{".class":"LiteralType","fallback":"builtins.str","value":"save_only_topk_weights"},{".class":"LiteralType","fallback":"builtins.str","value":"vblora_dropout"},{".class":"LiteralType","fallback":"builtins.str","value":"fan_in_fan_out"},{".class":"LiteralType","fallback":"builtins.str","value":"bias"},{".class":"LiteralType","fallback":"builtins.str","value":"modules_to_save"},{".class":"LiteralType","fallback":"builtins.str","value":"init_vector_bank_bound"},{".class":"LiteralType","fallback":"builtins.str","value":"init_logits_std"},{".class":"LiteralType","fallback":"builtins.str","value":"layers_to_transform"},{".class":"LiteralType","fallback":"builtins.str","value":"layers_pattern"}],"partial_fallback":{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.tuple"}}},"plugin_generated":true},"__match_args__-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.vblora.config.VBLoRAConfig.__match_args__","kind":"Mdef","plugin_generated":true},"__mypy-post_init":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.__mypy-post_init","name":"__mypy-post_init","original_first_arg":"self","type":{".class":"CallableType","arg_kinds":[0],"arg_names":["self"],"arg_types":["peft.tuners.vblora.config.VBLoRAConfig"],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-post_init of VBLoRAConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"plugin_generated":true},"__mypy-post_init-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.vblora.config.VBLoRAConfig.__mypy-post_init","kind":"Mdef","plugin_generated":true},"__mypy-replace":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Decorator","func":{".class":"FuncDef","abstract_status":0,"arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","r","num_vectors","vector_length","topk","target_modules","exclude_modules","save_only_topk_weights","vblora_dropout","fan_in_fan_out","bias","modules_to_save","init_vector_bank_bound","init_logits_std","layers_to_transform","layers_pattern"],"dataclass_transform_spec":null,"deprecated":null,"flags":["is_static","is_decorated"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.__mypy-replace","name":"__mypy-replace","original_first_arg":"task_type","type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","r","num_vectors","vector_length","topk","target_modules","exclude_modules","save_only_topk_weights","vblora_dropout","fan_in_fan_out","bias","modules_to_save","init_vector_bank_bound","init_logits_std","layers_to_transform","layers_pattern"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int","builtins.int","builtins.int","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.float","builtins.bool","builtins.str",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.float","builtins.float",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-replace of VBLoRAConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}},"is_overload":false,"var":{".class":"Var","flags":["is_staticmethod","is_ready"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.__mypy-replace","name":"__mypy-replace","setter_type":null,"type":{".class":"CallableType","arg_kinds":[5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5,5],"arg_names":["task_type","peft_type","auto_mapping","peft_version","base_model_name_or_path","revision","inference_mode","r","num_vectors","vector_length","topk","target_modules","exclude_modules","save_only_topk_weights","vblora_dropout","fan_in_fan_out","bias","modules_to_save","init_vector_bank_bound","init_logits_std","layers_to_transform","layers_pattern"],"arg_types":[{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.TaskType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str","peft.utils.peft_types.PeftType",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":[{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4}],"extra_attrs":null,"type_ref":"builtins.dict"},{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":["builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.int","builtins.int","builtins.int","builtins.int",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.bool","builtins.float","builtins.bool","builtins.str",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false},"builtins.float","builtins.float",{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false},{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}],"fallback":"builtins.function","from_concatenate":false,"implicit":false,"imprecise_arg_kinds":false,"is_bound":false,"is_ellipsis_args":false,"name":"__mypy-replace of VBLoRAConfig","ret_type":{".class":"NoneType"},"type_guard":null,"type_is":null,"unpack_kwargs":false,"variables":[]}}},"plugin_generated":true},"__mypy-replace-redefinition":{".class":"SymbolTableNode","cross_ref":"peft.tuners.vblora.config.VBLoRAConfig.__mypy-replace","kind":"Mdef","plugin_generated":true},"__post_init__":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"FuncDef","abstract_status":0,"arg_kinds":[0],"arg_names":["self"],"dataclass_transform_spec":null,"deprecated":null,"flags":[],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.__post_init__","name":"__post_init__","original_first_arg":"self","type":null}},"bias":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.bias","name":"bias","setter_type":null,"type":"builtins.str"}},"exclude_modules":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.exclude_modules","name":"exclude_modules","setter_type":null,"type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}}},"fan_in_fan_out":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.fan_in_fan_out","name":"fan_in_fan_out","setter_type":null,"type":"builtins.bool"}},"init_logits_std":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.init_logits_std","name":"init_logits_std","setter_type":null,"type":"builtins.float"}},"init_vector_bank_bound":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.init_vector_bank_bound","name":"init_vector_bank_bound","setter_type":null,"type":"builtins.float"}},"layers_pattern":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.layers_pattern","name":"layers_pattern","setter_type":null,"type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}}},"layers_to_transform":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.layers_to_transform","name":"layers_to_transform","setter_type":null,"type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.int"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.int",{".class":"NoneType"}],"uses_pep604_syntax":false}}},"modules_to_save":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.modules_to_save","name":"modules_to_save","setter_type":null,"type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},{".class":"NoneType"}],"uses_pep604_syntax":false}}},"num_vectors":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.num_vectors","name":"num_vectors","setter_type":null,"type":"builtins.int"}},"r":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.r","name":"r","setter_type":null,"type":"builtins.int"}},"save_only_topk_weights":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.save_only_topk_weights","name":"save_only_topk_weights","setter_type":null,"type":"builtins.bool"}},"target_modules":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.target_modules","name":"target_modules","setter_type":null,"type":{".class":"UnionType","items":[{".class":"Instance","args":["builtins.str"],"extra_attrs":null,"type_ref":"builtins.list"},"builtins.str",{".class":"NoneType"}],"uses_pep604_syntax":false}}},"topk":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.topk","name":"topk","setter_type":null,"type":"builtins.int"}},"vblora_dropout":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.vblora_dropout","name":"vblora_dropout","setter_type":null,"type":"builtins.float"}},"vector_length":{".class":"SymbolTableNode","kind":"Mdef","node":{".class":"Var","flags":["is_initialized_in_class","is_ready","has_explicit_value"],"fullname":"peft.tuners.vblora.config.VBLoRAConfig.vector_length","name":"vector_length","setter_type":null,"type":"builtins.int"}}},"self_type":{".class":"TypeVarType","default":{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":4},"fullname":"peft.tuners.vblora.config.VBLoRAConfig.Self","id":0,"name":"Self","namespace":"","upper_bound":"peft.tuners.vblora.config.VBLoRAConfig","values":[],"variance":0},"slots":null,"tuple_type":null,"type_vars":[],"typeddict_type":null}},"__annotations__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.vblora.config.__annotations__","name":"__annotations__","setter_type":null,"type":{".class":"Instance","args":["builtins.str",{".class":"AnyType","missing_import_name":null,"source_any":null,"type_of_any":6}],"extra_attrs":null,"type_ref":"builtins.dict"}}},"__doc__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.vblora.config.__doc__","name":"__doc__","setter_type":null,"type":"builtins.str"}},"__file__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.vblora.config.__file__","name":"__file__","setter_type":null,"type":"builtins.str"}},"__name__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.vblora.config.__name__","name":"__name__","setter_type":null,"type":"builtins.str"}},"__package__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.vblora.config.__package__","name":"__package__","setter_type":null,"type":"builtins.str"}},"__spec__":{".class":"SymbolTableNode","kind":"Gdef","node":{".class":"Var","flags":["is_ready"],"fullname":"peft.tuners.vblora.config.__spec__","name":"__spec__","setter_type":null,"type":"_frozen_importlib.ModuleSpec"}},"annotations":{".class":"SymbolTableNode","cross_ref":"__future__.annotations","kind":"Gdef"},"dataclass":{".class":"SymbolTableNode","cross_ref":"dataclasses.dataclass","kind":"Gdef"},"field":{".class":"SymbolTableNode","cross_ref":"dataclasses.field","kind":"Gdef"}},"path":"C:\\Users\\Administrator\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\peft\\tuners\\vblora\\config.py"}